eprime_tony_notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-11-21 Thu 22:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>E-Prime Notes by Antonis: The most important thing when you design an experiment is to SAVE as frequently as possible</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tony" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">E-Prime Notes by Antonis: The most important thing when you design an experiment is to SAVE as frequently as possible</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0ef1935">1. Types of E-prime files</a></li>
<li><a href="#orgdbbf8fa">2. Sessionproc (= procedure)</a>
<ul>
<li><a href="#org5597226">2.1. TextDisplay</a></li>
<li><a href="#org77abac2">2.2. ImageDisplay</a></li>
<li><a href="#org74d94ba">2.3. MovieDisplay</a></li>
<li><a href="#orgc5e0b00">2.4. Lists (put multiple items (TRIALS!) together)</a></li>
<li><a href="#org9398437">2.5. Slide</a></li>
</ul>
</li>
<li><a href="#orgad268fb">3. Οbject duration / keyboard input / logging</a>
<ul>
<li><a href="#org03bf0c8">3.1. Duration/Input</a>
<ul>
<li><a href="#orgd6372ad">3.1.1. Duration</a></li>
<li><a href="#org01dec0f">3.1.2. Input</a></li>
<li><a href="#orgdf06d8e">3.1.3. Correct</a></li>
</ul>
</li>
<li><a href="#orgc450269">3.2. Logging</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0ef1935" class="outline-2">
<h2 id="org0ef1935"><span class="section-number-2">1</span> Types of E-prime files</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><span class="underline">E-Studio</span> to design/edit experiment</li>
<li><span class="underline">E-Run</span> to "run" experiment (you must RUN the experiment FIRST through
the "run" button in E-studio in order to create the E-run file AND to
APPLY CHANGES in the E-Run you made in the design of the experiment).</li>
<li><span class="underline">E-dat</span> files for each participant, after they have been created. 
SEE ALSO: "Arrange collums" button to remove uncecessary info from E-dat files. (E-prime creates also .txt files for each participant which are not really readable)</li>
</ul>
</div>
</div>

<div id="outline-container-orgdbbf8fa" class="outline-2">
<h2 id="orgdbbf8fa"><span class="section-number-2">2</span> Sessionproc (= procedure)</h2>
<div class="outline-text-2" id="text-2">
<p>
  A continuous line in which e-objects (= all things that will appear on screen sequentially) are placed one after another.
Frequently used objects (put in Sessionproc via drag &amp; drop from menu on the left):
</p>
</div>
<div id="outline-container-org5597226" class="outline-3">
<h3 id="org5597226"><span class="section-number-3">2.1</span> TextDisplay</h3>
<div class="outline-text-3" id="text-2-1">
<p>
e.g. Welcome to the Psych Labs, Instructions, Fixation-cross, "PRESS SPACE TO BEGIN"* etc.
</p>
</div>
</div>
<div id="outline-container-org77abac2" class="outline-3">
<h3 id="org77abac2"><span class="section-number-3">2.2</span> ImageDisplay</h3>
<div class="outline-text-3" id="text-2-2">
<p>
You can create multiple trials by clicking on its properties and placing
the relevant list/attribute in the filename (e.g. [pics] or [pics1] according to how
you have named it
</p>
<ul class="org-ul">
<li>use ALWAYS .bmp file format</li>
<li>and ALWAYS put image files in the SAME FOLDER with the E-prime (E-studio) file.</li>
</ul>
</div>
</div>
<div id="outline-container-org74d94ba" class="outline-3">
<h3 id="org74d94ba"><span class="section-number-3">2.3</span> MovieDisplay</h3>
<div class="outline-text-3" id="text-2-3">
<p>
(used for Videos (not so frequent; use youtube/vlc)
</p>
</div>
</div>

<div id="outline-container-orgc5e0b00" class="outline-3">
<h3 id="orgc5e0b00"><span class="section-number-3">2.4</span> Lists (put multiple items (TRIALS!) together)</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Procedure: Create one by puting a name on it (e.g. proc1)</li>

<li>Attribute: Add atribute (e.g. Text or Images) <i>OR</i> correct answers = named "Correct" for each trial; e.g. 0, 1 etc.)</li>

<li>Levels (multiple): Add them accordingly for multiple trials (e.g. 29 new leves + 1 already existing = 30).</li>
</ul>

<p>
You can also change the sequence of presentation via: PROPERTIES BUTTON -&gt; "selection" tab -&gt; change order (sequential OR random etc.) 
</p>

<p>
You can (and should) rename each object name accordingly (e.g. "Instructions"/ "Fixation" etc.)
</p>
</div>
</div>

<div id="outline-container-org9398437" class="outline-3">
<h3 id="org9398437"><span class="section-number-3">2.5</span> Slide</h3>
<div class="outline-text-3" id="text-2-5">
<ol class="org-ol">
<li>Allows many options/features (e.g. put multiple objects, add Likert scales or even add a "click" button that will appear on screen.
<ul class="org-ul">
<li>not so frequently used</li>
</ul></li>
<li>To add an already created procedure inside an object (e.g. on a TextDisplay) simply type "[" (left square bracket) to see  a mini-list of the available procedures that you have created. If the mini-list does not work or you are sure which procedure you want to put there, simply put its name inside the brackets.
<ul class="org-ul">
<li>can be used in order to produce multiple trials.</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgad268fb" class="outline-2">
<h2 id="orgad268fb"><span class="section-number-2">3</span> Οbject duration / keyboard input / logging</h2>
<div class="outline-text-2" id="text-3">
<p>
Upper left area of object-window:  click on PROPERTIES BUTTON (orange small hand at top left of the window)
</p>
</div>
<div id="outline-container-org03bf0c8" class="outline-3">
<h3 id="org03bf0c8"><span class="section-number-3">3.1</span> Duration/Input</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgd6372ad" class="outline-4">
<h4 id="orgd6372ad"><span class="section-number-4">3.1.1</span> Duration</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>Set miliseconds (1000ms = 1 sec) OR</li>
<li>Set to " Infinite" (to wait for input)</li>
<li>Time limit = set it MANUALLY to be the exact same number as duration (to avoid E-prime crashing!)</li>
</ul>
</div>
</div>
<div id="outline-container-org01dec0f" class="outline-4">
<h4 id="org01dec0f"><span class="section-number-4">3.1.2</span> Input</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li><p>
Add device (keyboard/mouse)
</p>
<ul class="org-ul">
<li>Keyboard: You can select which buttons to use via the tab "Allowable".Default = {ANY} . Can be changed for example</li>
</ul>
<p>
to* {SPACE}. Just type 123 for numbers (or abc for letters) without brackets. See also E-studio: "Help" tab for keywords.
</p>
<ul class="org-ul">
<li>If by any chance you collect demographics via E-prime, you can set the limit of responses to specific digits (e.g. for Age max = 2 digits and then it moves to the next screen)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgdf06d8e" class="outline-4">
<h4 id="orgdf06d8e"><span class="section-number-4">3.1.3</span> Correct</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
   You can place inside { } the name of the Attribute (you have named it) that corresponds to the list
with the correct responses for each trial. (e.g. {correct})
</p>
</div>
</div>
</div>

<div id="outline-container-orgc450269" class="outline-3">
<h3 id="orgc450269"><span class="section-number-3">3.2</span> Logging</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Frequently used: 
<ul class="org-ul">
<li>Actual Response (REP)</li>
<li>Reaction Time (RT)</li>
<li>Correct response (CREP; this must be defined accordingly with a List-attribute)</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tony</p>
<p class="date">Created: 2019-11-21 Thu 22:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
